IDEA Open Model
OpenModelResult Class
Compatible with IDEA StatiCa 20.1
 Results of open model
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.OpenModelResult
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public class OpenModelResult
Public Class OpenModelResult
The OpenModelResult type exposes the following members.
Constructors
Name | Description
OpenModelResult
 Constructor
Top
Properties
Name | Description
ResultOnMembers
 Results on members
Top
Methods
Name | Description
LoadFromStream
 Creates the instance of Open Model Result from the stream
LoadFromXmlFile
 Creates the instance of Open Model Result from the XML file
SaveToXmlFile
 Saves content into file as a XML format
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace